ch32-riscv-ug/ArduinoCore-CH32/cores/arduino/ch32_registers.h
/* Minimal CH32 register map owned by this core.
 *
 * This is an own implementation, not a copy of the WCH EVT headers: it defines
 * only the registers the core actually touches, uses plain offsets instead of
 * packed structs, and names things after the reference manual. Register
 * addresses are hardware facts; the EVT headers were read as a cross-check.
 *
 * Family differences are driven by build.core_defines (generated by
 * tools/generate/generate.py from the FAMILY table):
 *   CH32_GPIO_PORT_WIDTH   8 (V003/V00x), 16 (most), 24 (X033/X035)
 *   CH32_SYSTICK_64        1 when SysTick CNT/CMP are 64-bit
 *   CH32_I2C_HAS_RTR       1 when the I2C block has a rise-time register
 *   CH32_IRQNS             generated header naming each interrupt slot
 */
#pragma once

#include <stdint.h>

#ifndef CH32_GPIO_PORT_WIDTH
#error "CH32_GPIO_PORT_WIDTH is required (see build.core_defines in boards.txt)"
#endif
#ifndef CH32_SYSTICK_64
#error "CH32_SYSTICK_64 is required (see build.core_defines in boards.txt)"
#endif
#ifndef CH32_IRQNS
#error "CH32_IRQNS is required (see build.core_defines in boards.txt)"
#endif

#ifndef CH32_I2C_HAS_RTR
#error "CH32_I2C_HAS_RTR is required (see build.core_defines in boards.txt)"
#endif

#ifndef CH32_EXTIS
#error "CH32_EXTIS is required (see build.core_defines in boards.txt)"
#endif

#define CH32_STRINGIFY_(s) #s
#define CH32_GENERATED_(s) CH32_STRINGIFY_(s)
#include CH32_GENERATED_(CH32_IRQNS)
#include CH32_GENERATED_(CH32_EXTIS)

#define CH32_REG32(addr) (*(volatile uint32_t *)(uintptr_t)(addr))
#define CH32_REG16(addr) (*(volatile uint16_t *)(uintptr_t)(addr))
#define CH32_REG8(addr)  (*(volatile uint8_t  *)(uintptr_t)(addr))

/* ---------------------------------------------------------------- buses */
#define CH32_APB1_BASE 0x40000000u
#define CH32_APB2_BASE 0x40010000u
#define CH32_AHB_BASE  0x40020000u

/* ------------------------------------------------------------------ RCC */
#define CH32_RCC_BASE      (CH32_AHB_BASE + 0x1000u)
#define CH32_RCC_CTLR      CH32_REG32(CH32_RCC_BASE + 0x00u)
#define CH32_RCC_CFGR0     CH32_REG32(CH32_RCC_BASE + 0x04u)
#define CH32_RCC_AHBPCENR  CH32_REG32(CH32_RCC_BASE + 0x14u)
#define CH32_RCC_APB2PCENR CH32_REG32(CH32_RCC_BASE + 0x18u)
#define CH32_RCC_APB1PCENR CH32_REG32(CH32_RCC_BASE + 0x1Cu)

#define CH32_RCC_CTLR_HSION  (1u << 0)
#define CH32_RCC_CTLR_HSIRDY (1u << 1)
/* Same on every family clock_symbols.csv covers (10 for PLLON/PLLRDY, 11 for
 * the SW fields below), which is why these are here and the PLL *value* is
 * not. */
#define CH32_RCC_CTLR_PLLON  (1u << 24)
#define CH32_RCC_CTLR_PLLRDY (1u << 25)

#define CH32_RCC_CFGR0_SW_MASK   0x3u        /* system clock switch          */
#define CH32_RCC_CFGR0_SW_HSI    0x0u
#define CH32_RCC_CFGR0_SW_PLL    0x2u
/* The fields the PLL configuration occupies are NOT the same everywhere, so
 * the mask to clear comes from boards.txt (CH32_CLOCK_PLL_MASK) rather than
 * from here: PLLMULL is four bits at 0x003C0000 on CH32V103/V20x/V30x/L103,
 * five bits at 0x007C0000 on CH32V205 and at 0x003E0000 on CH32V407, and
 * CH32X315 uses different fields entirely. CH32V307 additionally has PLL2MUL
 * and PLL3MUL in the same register, which must not be cleared along with it.
 */
#define CH32_RCC_CFGR0_SWS_MASK  (0x3u << 2) /* switch status (read-back)    */
#define CH32_RCC_CFGR0_HPRE_MASK (0xFu << 4) /* AHB prescaler                */
/* The field value itself, not the divider: the CH32 line encodes AHB dividers
 * two different ways and only wiring_time.c knows which one this build needs.
 * See CH32_HPRE_LINEAR there. */
#define CH32_RCC_CFGR0_HPRE(n)   ((uint32_t)(n) << 4)
#define CH32_RCC_CFGR0_PPRE1_MASK (0x7u << 8)
#define CH32_RCC_CFGR0_PPRE2_MASK (0x7u << 11)

/* APB2 peripheral clock enables (bit positions are uniform across CH32). */
/* Peripheral clock enables are NOT spelled out here. The register and bit
 * differ per family - CH32V006 has USART2 on the APB2 register at bit 13
 * where the F1-style parts have it on APB1 bit 17, and its TIM3 is bit 2 not
 * bit 1 - and two of the hand-written constants that used to live here were
 * exactly those two, wrong for that whole family and never caught because no
 * V00x board was on the bench. The variant header now carries
 *
 *     CH32_CLKEN_<PERIPHERAL>_ADDR / _MASK      (generated from clock_enables.csv)
 *
 * for every block the family has, plus CH32_CLKEN_GPIO_ADDR/_BIT0 for the
 * ports, and the helpers below use them. */
#define CH32_CLKEN_(name, op) \
    (CH32_REG32(CH32_CLKEN_##name##_ADDR) op CH32_CLKEN_##name##_MASK)
#define ch32_clock_enable(name)  CH32_CLKEN_(name, |=)
#define ch32_clock_disable(name) CH32_CLKEN_(name, &= ~)
static inline void ch32_clock_enable_at(uint32_t addr, uint32_t mask)
{
    CH32_REG32(addr) |= mask;
}
static inline void ch32_clock_disable_at(uint32_t addr, uint32_t mask)
{
    CH32_REG32(addr) &= ~mask;
}
/* APB1 */

/* ------------------------------------------------------------------ I2C */
/* Both instances sit on APB1. Families with one I2C simply have no I2C2 pins,
 * so nothing names the second base. The registers are 16-bit and every one is
 * padded to a 32-bit slot, which is why the offsets step by four. */
#define CH32_I2C1_BASE (CH32_APB1_BASE + 0x5400u)
#define CH32_I2C2_BASE (CH32_APB1_BASE + 0x5800u)

#define CH32_I2C_CTLR1(b)  CH32_REG16((b) + 0x00u)
#define CH32_I2C_CTLR2(b)  CH32_REG16((b) + 0x04u)
#define CH32_I2C_OADDR1(b) CH32_REG16((b) + 0x08u)
#define CH32_I2C_OADDR2(b) CH32_REG16((b) + 0x0Cu)
#define CH32_I2C_DATAR(b)  CH32_REG16((b) + 0x10u)
#define CH32_I2C_STAR1(b)  CH32_REG16((b) + 0x14u)
#define CH32_I2C_STAR2(b)  CH32_REG16((b) + 0x18u)
#define CH32_I2C_CKCFGR(b) CH32_REG16((b) + 0x1Cu)
/* Rise-time register. V003/V00x/X03x/M030 have no such register - their I2C
 * block ends at CKCFGR - so it is only written where CH32_I2C_HAS_RTR says so
 * (build.core_defines, from the FAMILY table in generate.py). */
#define CH32_I2C_RTR(b)    CH32_REG16((b) + 0x20u)

#define CH32_I2C_CTLR1_PE      (1u << 0)   /* peripheral enable             */
#define CH32_I2C_CTLR1_START   (1u << 8)
#define CH32_I2C_CTLR1_STOP    (1u << 9)
#define CH32_I2C_CTLR1_ACK     (1u << 10)
#define CH32_I2C_CTLR1_POS     (1u << 11)  /* ACK applies to the next byte  */
#define CH32_I2C_CTLR1_SWRST   (1u << 15)

#define CH32_I2C_CTLR2_FREQ_MASK 0x3Fu     /* APB1 clock in MHz             */
#define CH32_I2C_CTLR2_ITERREN  (1u << 8)  /* error interrupt enable        */
#define CH32_I2C_CTLR2_ITEVTEN  (1u << 9)  /* event interrupt enable        */
#define CH32_I2C_CTLR2_ITBUFEN  (1u << 10) /* TXE/RXNE raise the event IRQ  */

#define CH32_I2C_STAR1_SB      (1u << 0)   /* start condition generated     */
#define CH32_I2C_STAR1_ADDR    (1u << 1)   /* address sent / matched        */
#define CH32_I2C_STAR1_BTF     (1u << 2)   /* byte transfer finished        */
#define CH32_I2C_STAR1_STOPF   (1u << 4)   /* stop received (slave)         */
#define CH32_I2C_STAR1_RXNE    (1u << 6)
#define CH32_I2C_STAR1_TXE     (1u << 7)
#define CH32_I2C_STAR1_BERR    (1u << 8)
#define CH32_I2C_STAR1_ARLO    (1u << 9)   /* arbitration lost              */
#define CH32_I2C_STAR1_AF      (1u << 10)  /* acknowledge failure = NACK    */
#define CH32_I2C_STAR1_OVR     (1u << 11)

#define CH32_I2C_STAR2_MSL     (1u << 0)   /* master mode                   */
#define CH32_I2C_STAR2_BUSY    (1u << 1)
#define CH32_I2C_STAR2_TRA     (1u << 2)   /* transmitting                  */

