ch32-riscv-ug/ArduinoCore-CH32/cores/arduino/ch32_registers.h
#define CH32_I2C_CKCFGR_CCR_MASK 0x0FFFu
#define CH32_I2C_CKCFGR_DUTY     (1u << 14) /* fast mode 16/9 instead of 2/1 */
#define CH32_I2C_CKCFGR_FS       (1u << 15) /* fast mode                     */

/* APB1 */

/* ------------------------------------------------------------------ SPI */
/* SPI1 is on APB2, SPI2/SPI3 on APB1. Like the I2C block the registers are
 * 16-bit in 32-bit slots. Only what a master transfer needs is named; the CRC
 * and I2S registers are left out. */
#define CH32_SPI1_BASE (CH32_APB2_BASE + 0x3000u)
#define CH32_SPI2_BASE (CH32_APB1_BASE + 0x3800u)
#define CH32_SPI3_BASE (CH32_APB1_BASE + 0x3C00u)

#define CH32_SPI_CTLR1(b) CH32_REG16((b) + 0x00u)
#define CH32_SPI_CTLR2(b) CH32_REG16((b) + 0x04u)
#define CH32_SPI_STATR(b) CH32_REG16((b) + 0x08u)
#define CH32_SPI_DATAR(b) CH32_REG16((b) + 0x0Cu)

#define CH32_SPI_CTLR1_CPHA      (1u << 0)
#define CH32_SPI_CTLR1_CPOL      (1u << 1)
#define CH32_SPI_CTLR1_MSTR      (1u << 2)
#define CH32_SPI_CTLR1_BR_SHIFT  3          /* divider = 2^(BR+1)            */
#define CH32_SPI_CTLR1_BR_MASK   (0x7u << 3)
#define CH32_SPI_CTLR1_SPE       (1u << 6)
#define CH32_SPI_CTLR1_LSBFIRST  (1u << 7)
#define CH32_SPI_CTLR1_SSI       (1u << 8)  /* the value NSS reads as        */
#define CH32_SPI_CTLR1_SSM       (1u << 9)  /* NSS from SSI, not from a pin  */
#define CH32_SPI_CTLR1_RXONLY    (1u << 10)
#define CH32_SPI_CTLR1_DFF       (1u << 11) /* 16-bit frames                 */
#define CH32_SPI_CTLR1_BIDIOE    (1u << 14)
#define CH32_SPI_CTLR1_BIDIMODE  (1u << 15)

#define CH32_SPI_STATR_RXNE      (1u << 0)
#define CH32_SPI_STATR_TXE       (1u << 1)
#define CH32_SPI_STATR_MODF      (1u << 5)
#define CH32_SPI_STATR_OVR       (1u << 6)
#define CH32_SPI_STATR_BSY       (1u << 7)

/* APB1 */

/* ------------------------------------------------------------------ DAC */
/* Only V303/V305/V307/V4x7 have one. The variant names the pads it reaches
 * (CH32_DACn_PIN); nothing here is referenced otherwise. */
#define CH32_DAC_BASE (CH32_APB1_BASE + 0x7400u)
#define CH32_DAC_CTLR      CH32_REG32(CH32_DAC_BASE + 0x00u)
#define CH32_DAC_R12BDHR1  CH32_REG32(CH32_DAC_BASE + 0x08u)
#define CH32_DAC_R12BDHR2  CH32_REG32(CH32_DAC_BASE + 0x14u)

#define CH32_DAC_CTLR_EN1   (1u << 0)
#define CH32_DAC_CTLR_BOFF1 (1u << 1)   /* 1 disables the output buffer */
#define CH32_DAC_CTLR_EN2   (1u << 16)
#define CH32_DAC_CTLR_BOFF2 (1u << 17)


/* ---------------------------------------------------------------- FLASH */
/* Flash controller registers (not the flash memory itself). */
#define CH32_FLASH_BASE  (CH32_AHB_BASE + 0x2000u)
#define CH32_FLASH_ACTLR CH32_REG32(CH32_FLASH_BASE + 0x00u)
/* The LATENCY field is not the same width everywhere: CH32V003/V006/V103/
 * L103/X035 have two bits, CH32M030 three, CH32V205 four - and CH32V20x,
 * CH32V307 and CH32V407 have no wait states at all, where the mask is 0 and
 * the field must be left alone rather than written with a harmless-looking 0.
 * boards.txt carries the family's own value, read out of clock_symbols.csv. */
#ifndef CH32_FLASH_ACTLR_LATENCY_MASK
#error "CH32_FLASH_ACTLR_LATENCY_MASK is required (see build.core_defines)"
#endif

/* ----------------------------------------------------------------- AFIO */
#define CH32_AFIO_BASE  (CH32_APB2_BASE + 0x0000u)
#define CH32_AFIO_ECR   CH32_REG32(CH32_AFIO_BASE + 0x00u)
#define CH32_AFIO_PCFR1 CH32_REG32(CH32_AFIO_BASE + 0x04u)  /* peripheral remap */
#define CH32_AFIO_PCFR2 CH32_REG32(CH32_AFIO_BASE + 0x1Cu)
/* CH32X035/X033 only: USB pad control. PC16 (UDM) / PC17 (UDP) belong to the
 * USB PHY; while USB_PHY_V33 is set their open-drain "release" cannot be pulled
 * low by another device (measured 2026-09-22, errata x035-usb-pads-open-drain). */
#define CH32_AFIO_CTLR              CH32_REG32(CH32_AFIO_BASE + 0x18u)
#define CH32_AFIO_CTLR_USB_PHY_V33  0x00000040u

/* ----------------------------------------------------------------- GPIO */
/* Ports are 0x400 apart starting at PA, whether or not the port exists. */
#define CH32_GPIO_BASE(port) (CH32_APB2_BASE + 0x0800u + 0x400u * (uint32_t)(port))
#define CH32_GPIO_CFGLR(p)   CH32_REG32(CH32_GPIO_BASE(p) + 0x00u)
#define CH32_GPIO_CFGHR(p)   CH32_REG32(CH32_GPIO_BASE(p) + 0x04u)
#define CH32_GPIO_INDR(p)    CH32_REG32(CH32_GPIO_BASE(p) + 0x08u)
#define CH32_GPIO_OUTDR(p)   CH32_REG32(CH32_GPIO_BASE(p) + 0x0Cu)
#define CH32_GPIO_BSHR(p)    CH32_REG32(CH32_GPIO_BASE(p) + 0x10u)
#define CH32_GPIO_BCR(p)     CH32_REG32(CH32_GPIO_BASE(p) + 0x14u)
#define CH32_GPIO_LCKR(p)    CH32_REG32(CH32_GPIO_BASE(p) + 0x18u)
/* 24-pin ports (X033/X035) only: config and set for bits 16..23. */
#define CH32_GPIO_CFGXR(p)   CH32_REG32(CH32_GPIO_BASE(p) + 0x1Cu)
#define CH32_GPIO_BSXR(p)    CH32_REG32(CH32_GPIO_BASE(p) + 0x20u)

/* Pin configuration nibble: (CNF << 2) | MODE, four bits per pin. */
#define CH32_GPIO_CFG_IN_ANALOG   0x0u
#define CH32_GPIO_CFG_IN_FLOAT    0x4u
#define CH32_GPIO_CFG_IN_PULL     0x8u  /* OUTDR bit picks up (1) or down (0) */
#define CH32_GPIO_CFG_OUT_PP_10M  0x1u
#define CH32_GPIO_CFG_OUT_OD_10M  0x5u
#define CH32_GPIO_CFG_AF_PP_50M   0xBu
#define CH32_GPIO_CFG_AF_OD_50M   0xFu

/* ---------------------------------------------------------------- USART */
#define CH32_USART1_BASE (CH32_APB2_BASE + 0x3800u)
#define CH32_USART2_BASE (CH32_APB1_BASE + 0x4400u)
#define CH32_USART3_BASE (CH32_APB1_BASE + 0x4800u)
#define CH32_USART4_BASE (CH32_APB1_BASE + 0x4C00u)   /* UART4 */
#define CH32_USART5_BASE (CH32_APB1_BASE + 0x5000u)   /* UART5 */

#define CH32_USART_STATR(b) CH32_REG16((b) + 0x00u)
#define CH32_USART_DATAR(b) CH32_REG16((b) + 0x04u)
#define CH32_USART_BRR(b)   CH32_REG16((b) + 0x08u)
#define CH32_USART_CTLR1(b) CH32_REG16((b) + 0x0Cu)
#define CH32_USART_CTLR2(b) CH32_REG16((b) + 0x10u)
#define CH32_USART_CTLR3(b) CH32_REG16((b) + 0x14u)

#define CH32_USART_STATR_PE   (1u << 0)
#define CH32_USART_STATR_FE   (1u << 1)
#define CH32_USART_STATR_NE   (1u << 2)
#define CH32_USART_STATR_ORE  (1u << 3)
#define CH32_USART_STATR_IDLE (1u << 4)
#define CH32_USART_STATR_RXNE (1u << 5)
#define CH32_USART_STATR_TC   (1u << 6)
#define CH32_USART_STATR_TXE  (1u << 7)

#define CH32_USART_CTLR1_RE     (1u << 2)
#define CH32_USART_CTLR1_TE     (1u << 3)
#define CH32_USART_CTLR1_RXNEIE (1u << 5)
#define CH32_USART_CTLR1_TXEIE  (1u << 7)
#define CH32_USART_CTLR1_PCE    (1u << 10)
#define CH32_USART_CTLR1_PS     (1u << 9)
#define CH32_USART_CTLR1_M      (1u << 12)
#define CH32_USART_CTLR1_UE     (1u << 13)

#define CH32_USART_CTLR2_STOP_1   (0u << 12)
#define CH32_USART_CTLR2_STOP_0P5 (1u << 12)
#define CH32_USART_CTLR2_STOP_2   (2u << 12)
#define CH32_USART_CTLR2_STOP_1P5 (3u << 12)

/* -------------------------------------------------------------- SysTick */
/* CH32V103 (QingKe V3A) lays this out differently from every other family:
 * there is no status register, the counter starts where SR is elsewhere, the
 * compare sits four bytes lower, CTLR has no interrupt-enable or clock-select
 * bit, and the source is fixed at HCLK/8. Confirmed against WCH's own
 * core_riscv.h, EVT's SYSTICK/SYSTICK_Interrupt example, and measured on a
 * CH32V103R8T6 - writing the compare at the other families' offset put it in
 * the high word, so the match never happened and millis() never advanced. */
#ifndef CH32_SYSTICK_V103
#error "CH32_SYSTICK_V103 is required (see build.core_defines in boards.txt)"
#endif

#define CH32_SYSTICK_BASE 0xE000F000u
#define CH32_SYSTICK_CTLR CH32_REG32(CH32_SYSTICK_BASE + 0x00u)
#if CH32_SYSTICK_V103
/* Read as a word - EVT's own delay loop does - but WRITE AS BYTES. WCH
 * declares these as four uint8_t each and every EVT example writes them one
 * byte at a time; a word write is ignored. Measured: after a word write the
 * counter carried on past the compare, matched once on the way up and never
 * again, so millis() stopped at 1. */
#define CH32_SYSTICK_CNT    CH32_REG32(CH32_SYSTICK_BASE + 0x04u)
#define CH32_SYSTICK_CNT_HI CH32_REG32(CH32_SYSTICK_BASE + 0x08u)
#define CH32_SYSTICK_CMP    CH32_REG32(CH32_SYSTICK_BASE + 0x0Cu)
#define CH32_SYSTICK_CMP_HI CH32_REG32(CH32_SYSTICK_BASE + 0x10u)
#define CH32_SYSTICK_WRITE8(off, v) do { \
    CH32_REG8(CH32_SYSTICK_BASE + (off) + 0u) = (uint8_t)((v) >> 0);  \
    CH32_REG8(CH32_SYSTICK_BASE + (off) + 1u) = (uint8_t)((v) >> 8);  \
    CH32_REG8(CH32_SYSTICK_BASE + (off) + 2u) = (uint8_t)((v) >> 16); \
    CH32_REG8(CH32_SYSTICK_BASE + (off) + 3u) = (uint8_t)((v) >> 24); \
} while (0)
#else
#define CH32_SYSTICK_SR   CH32_REG32(CH32_SYSTICK_BASE + 0x04u)
#define CH32_SYSTICK_CNT  CH32_REG32(CH32_SYSTICK_BASE + 0x08u)  /* low word */
#define CH32_SYSTICK_CMP  CH32_REG32(CH32_SYSTICK_BASE + 0x10u)  /* low word */
#if CH32_SYSTICK_64
#define CH32_SYSTICK_CNT_HI CH32_REG32(CH32_SYSTICK_BASE + 0x0Cu)
#define CH32_SYSTICK_CMP_HI CH32_REG32(CH32_SYSTICK_BASE + 0x14u)
#endif
#endif

