ch32-riscv-ug/ArduinoCore-CH32/cores/arduino/ch32_registers.h
#define CH32_SYSTICK_CTLR_STE   (1u << 0)  /* counter enable                 */
#define CH32_SYSTICK_CTLR_STIE  (1u << 1)  /* interrupt enable               */
#define CH32_SYSTICK_CTLR_STCLK (1u << 2)  /* 1 = HCLK, 0 = HCLK/8           */

/* ------------------------------------------------------- PFIC (like NVIC) */
#define CH32_PFIC_BASE    0xE000E000u
#define CH32_PFIC_IENR(i) CH32_REG32(CH32_PFIC_BASE + 0x100u + 4u * (i))
#define CH32_PFIC_IRER(i) CH32_REG32(CH32_PFIC_BASE + 0x180u + 4u * (i))
#define CH32_PFIC_IPRIOR(n) CH32_REG8(CH32_PFIC_BASE + 0x400u + (n))

static inline void ch32_irq_enable(uint32_t irqn)
{
    CH32_PFIC_IENR(irqn >> 5) = 1u << (irqn & 31u);
}

static inline void ch32_irq_disable(uint32_t irqn)
{
    CH32_PFIC_IRER(irqn >> 5) = 1u << (irqn & 31u);
}

/* System reset through the PFIC, the RISC-V equivalent of NVIC_SystemReset:
 * the config register takes a key in the top half and the reset request in
 * bit 7. Identical across every EVT's core_riscv.h. */
#define CH32_PFIC_CFGR    CH32_REG32(CH32_PFIC_BASE + 0x48u)
#define CH32_PFIC_KEY3    0xBEEF0000u
#define CH32_PFIC_SYSRST  (1u << 7)

/* ---------------------------------------------------------- reset cause */
/* RSTSCKR sits at RCC+0x24 with the same flag bits on every family checked
 * (V003/V00x/V103/L103/X035/V307/M030); some families add flags in lower
 * bits, which readers should ignore rather than misname. The flags survive
 * everything except a write of RMVF, so they describe the *oldest* unread
 * reset, not necessarily the latest. */
#define CH32_RCC_RSTSCKR  CH32_REG32(CH32_RCC_BASE + 0x24u)
#define CH32_RST_RMVF     (1u << 24)   /* write 1 to clear all flags */
#define CH32_RST_PIN      (1u << 26)   /* NRST pin                    */
#define CH32_RST_POR      (1u << 27)   /* power on                    */
#define CH32_RST_SFT      (1u << 28)   /* software (CH32_PFIC_SYSRST) */
#define CH32_RST_IWDG     (1u << 29)
#define CH32_RST_WWDG     (1u << 30)
#define CH32_RST_LPWR     (1u << 31)

/* ----------------------------------------------------------------- IWDG */
/* The independent watchdog: LSI-clocked, and irreversible by design - once
 * the 0xCCCC key starts it, only a reset stops it. Registers and keys are
 * the F1-classic layout on every family that has the block; CH32_IWDG_BASE
 * itself comes from build.core_defines, generated from memory_map.csv, so a
 * family without the block (CH32M030) simply has no base and no watchdog
 * API. */
#define CH32_IWDG_CTLR    CH32_REG16(CH32_IWDG_BASE + 0x00u)  /* key register */
#define CH32_IWDG_PSCR    CH32_REG16(CH32_IWDG_BASE + 0x04u)  /* prescaler   */
#define CH32_IWDG_RLDR    CH32_REG16(CH32_IWDG_BASE + 0x08u)  /* reload      */
#define CH32_IWDG_STATR   CH32_REG16(CH32_IWDG_BASE + 0x0Cu)  /* update busy */
#define CH32_IWDG_KEY_UNLOCK 0x5555u   /* PSCR/RLDR become writable  */
#define CH32_IWDG_KEY_FEED   0xAAAAu
#define CH32_IWDG_KEY_START  0xCCCCu

/* ------------------------------------------------------------------ ADC */
/* Layout is the same on every family the platform builds for - checked
 * against index/registers.csv for all twelve, CH32X315 included - so only the
 * base address changes between instances, and only the conversion width
 * changes between families (CH32_ADC_BITS, from build.core_defines).
 *
 * The _AT(base) forms exist for CH32X305/CH32X315, whose four ADCs sit on
 * disjoint pads: there, a pad names an instance as well as a channel, and the
 * variant maps it (CH32_PIN_TO_ADC_INSTANCE). Everywhere else the base folds
 * to the ADC1 constant and the generated code is unchanged. */
#define CH32_ADC1_BASE   (CH32_APB2_BASE + 0x2400u)
#define CH32_ADC_STATR_AT(base)   CH32_REG32((base) + 0x00u)
#define CH32_ADC_CTLR1_AT(base)   CH32_REG32((base) + 0x04u)
#define CH32_ADC_CTLR2_AT(base)   CH32_REG32((base) + 0x08u)
#define CH32_ADC_SAMPTR1_AT(base) CH32_REG32((base) + 0x0Cu) /* channels 10..17 */
#define CH32_ADC_SAMPTR2_AT(base) CH32_REG32((base) + 0x10u) /* channels 0..9   */
#define CH32_ADC_RSQR1_AT(base)   CH32_REG32((base) + 0x2Cu)
#define CH32_ADC_RSQR3_AT(base)   CH32_REG32((base) + 0x34u)
#define CH32_ADC_RDATAR_AT(base)  CH32_REG32((base) + 0x4Cu)

#define CH32_ADC_STATR   CH32_ADC_STATR_AT(CH32_ADC1_BASE)
#define CH32_ADC_CTLR1   CH32_ADC_CTLR1_AT(CH32_ADC1_BASE)
#define CH32_ADC_CTLR2   CH32_ADC_CTLR2_AT(CH32_ADC1_BASE)
#define CH32_ADC_SAMPTR1 CH32_ADC_SAMPTR1_AT(CH32_ADC1_BASE)
#define CH32_ADC_SAMPTR2 CH32_ADC_SAMPTR2_AT(CH32_ADC1_BASE)
#define CH32_ADC_RSQR1   CH32_ADC_RSQR1_AT(CH32_ADC1_BASE)
#define CH32_ADC_RSQR3   CH32_ADC_RSQR3_AT(CH32_ADC1_BASE)
#define CH32_ADC_RDATAR  CH32_ADC_RDATAR_AT(CH32_ADC1_BASE)

#define CH32_ADC_STATR_EOC   (1u << 1)
#define CH32_ADC_CTLR2_ADON    (1u << 0)
#define CH32_ADC_CTLR2_CAL     (1u << 2)
#define CH32_ADC_CTLR2_RSTCAL  (1u << 3)
#define CH32_ADC_CTLR2_EXTSEL_SWSTART (7u << 17)
#define CH32_ADC_CTLR2_EXTTRIG (1u << 20)
#define CH32_ADC_CTLR2_SWSTART (1u << 22)
/* RCC_CFGR0 ADCPRE: 00=/2 01=/4 10=/6 11=/8. ADCCLK must stay under 14 MHz. */
#define CH32_RCC_CFGR0_ADCPRE_MASK (0x3u << 14)
#define CH32_RCC_CFGR0_ADCPRE(n)   ((uint32_t)(n) << 14)

/* ----------------------------------------------------------------- EXTI */
#define CH32_EXTI_BASE   (CH32_APB2_BASE + 0x0400u)
#define CH32_EXTI_INTENR CH32_REG32(CH32_EXTI_BASE + 0x00u)
#define CH32_EXTI_EVENR  CH32_REG32(CH32_EXTI_BASE + 0x04u)
#define CH32_EXTI_RTENR  CH32_REG32(CH32_EXTI_BASE + 0x08u)
#define CH32_EXTI_FTENR  CH32_REG32(CH32_EXTI_BASE + 0x0Cu)
#define CH32_EXTI_SWIEVR CH32_REG32(CH32_EXTI_BASE + 0x10u)
#define CH32_EXTI_INTFR  CH32_REG32(CH32_EXTI_BASE + 0x14u)
/* Which port drives EXTI line n: four lines per word, four bits each. */
#define CH32_AFIO_EXTICR(n) CH32_REG32(CH32_AFIO_BASE + 0x08u + 4u * (n))

/* ---------------------------------------------------------------- timers */
/* TIM1 is the advanced timer on APB2; TIM2/TIM3 are general purpose on APB1.
 * The register block is the same for all of them. */
#define CH32_TIM1_BASE (CH32_APB2_BASE + 0x2C00u)
#define CH32_TIM2_BASE (CH32_APB1_BASE + 0x0000u)
#define CH32_TIM3_BASE (CH32_APB1_BASE + 0x0400u)
/* Only some families have these. Which one tone() uses is decided by the
 * generator and named by CH32_TONE_TIMER in the variant. */
#define CH32_TIM4_BASE (CH32_APB1_BASE + 0x0800u)
#define CH32_TIM5_BASE (CH32_APB1_BASE + 0x0C00u)
#define CH32_TIM6_BASE (CH32_APB1_BASE + 0x1000u)
#define CH32_TIM7_BASE (CH32_APB1_BASE + 0x1400u)

#define CH32_TIM_CTLR1(b)   CH32_REG16((b) + 0x00u)
#define CH32_TIM_DMAINTENR(b) CH32_REG16((b) + 0x0Cu) /* interrupt enables */
#define CH32_TIM_INTFR(b)   CH32_REG16((b) + 0x10u)   /* interrupt flags   */
#define CH32_TIM_SWEVGR(b)  CH32_REG16((b) + 0x14u)   /* software events   */
#define CH32_TIM_CHCTLR1(b) CH32_REG16((b) + 0x18u)   /* channels 1 and 2 */
#define CH32_TIM_CHCTLR2(b) CH32_REG16((b) + 0x1Cu)   /* channels 3 and 4 */
#define CH32_TIM_CCER(b)    CH32_REG16((b) + 0x20u)
#define CH32_TIM_CNT(b)     CH32_REG16((b) + 0x24u)
#define CH32_TIM_PSC(b)     CH32_REG16((b) + 0x28u)
#define CH32_TIM_ATRLR(b)   CH32_REG16((b) + 0x2Cu)   /* auto-reload */
#define CH32_TIM_CHCVR(b, ch) CH32_REG16((b) + 0x34u + 4u * ((ch) - 1u))

/* Some families have one 32-bit timer, and on it CNT, ATRLR and CHnCVR are a
 * single 32-bit register rather than a 16-bit one with a reserved upper half.
 * A 16-bit store to such a register is *replicated into both halves* by the
 * bus: writing 7999 (0x1F3F) to ATRLR leaves 0x1F3F1F3F, so the counter runs
 * for a minute instead of a millisecond and the update event never arrives.
 *
 * Measured on CH32L103's TIM4 on 2026-08-25, which is what made tone() silent
 * there. EVT's own header says the same, with a union: ch32l103.h has
 * ATRLR_TIM4/CNT_TIM4 beside the 16-bit ATRLR/CNT.
 *
 * The variant says which timer is wide, as CH32_<user>_TIMER_BITS. */
#define CH32_TIM_CNT32(b)   CH32_REG32((b) + 0x24u)
#define CH32_TIM_ATRLR32(b) CH32_REG32((b) + 0x2Cu)
#define CH32_TIM_CHCVR32(b, ch) CH32_REG32((b) + 0x34u + 4u * ((ch) - 1u))
#define CH32_TIM_BDTR(b)    CH32_REG16((b) + 0x44u)   /* TIM1 only */

#define CH32_TIM_CTLR1_CEN  (1u << 0)
#define CH32_TIM_CTLR1_ARPE (1u << 7)
#define CH32_TIM_INT_UIE    (1u << 0)  /* update interrupt enable / flag */
#define CH32_TIM_SWEVGR_UG  (1u << 0)  /* force an update event          */
#define CH32_TIM_BDTR_MOE   (1u << 15)
/* PWM mode 1 with preload, in the low or high half of a CHCTLR word. */
#define CH32_TIM_OCMODE_PWM1 0x68u

